src/Catalogs/СтатьиДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтатьиДвиженияДенежныхСредств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КорреспондирующийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатьиДвиженияДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Проверяет является ли переданная ссылка предопределенной группой вида деятельности
//
// Параметры:
//   Ссылка - Справочник.СтатьиДвиженияДенежныхСредств.Ссылка - Ссылка на элемент, который нужно проверить
//
Функция ЭтоГруппаВидаДеятельности(Ссылка) Экспорт
	
	Результат = (Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ОперационнаяДеятельность
				ИЛИ Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционнаяДеятельность 
				ИЛИ Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ФинансоваяДеятельность
				ИЛИ Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещенияКурсовыеРазницы);
				
	Возврат Результат;
	
КонецФункции

// Проверяет был ли изменен родитель у переданной предопределенной группы
//
// Параметры:
//   Ссылка - Справочник.СтатьиДвиженияДенежныхСредств.Ссылка - Ссылка на элемент, который нужно проверить
//   Родитель - Справочник.СтатьиДвиженияДенежныхСредств.Ссылка - Текущий родитель элемента
//
Функция ИзмененРодительПредопределеннойГруппы(Ссылка, Родитель) Экспорт
	
	ЭтоИнвестиционнаяДеятельность = (Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПлатежи
									ИЛИ Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПоступления);
	ЭтоОперационнаяДеятельность = (Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи
									ИЛИ Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ОперационныеПоступления);
	ЭтоФинансоваяДеятельность = (Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ФинансовыеПлатежи
									ИЛИ Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ФинансовыеПоступления);
	
	Если ЭтоИнвестиционнаяДеятельность И Родитель <> Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционнаяДеятельность 
		ИЛИ ЭтоОперационнаяДеятельность И Родитель <> Справочники.СтатьиДвиженияДенежныхСредств.ОперационнаяДеятельность
		ИЛИ ЭтоФинансоваяДеятельность И Родитель <> Справочники.СтатьиДвиженияДенежныхСредств.ФинансоваяДеятельность Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// Возвращает предопределенное описание статьи, которая соответствует виду деятельности
//
// Параметры:
//   Ссылка - Справочник.СтатьиДвиженияДенежныхСредств.Ссылка - Ссылка на элемент, описание которого нужно получить
//
Функция ПолучитьОписаниеПредопределеннойСтатьи(Ссылка) Экспорт
	
	Если Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ОперационнаяДеятельность Тогда
		
		Описание =  НСтр("ru = 'Поступления и платежи, связанные с основной ежедневной деятельностью компании: 
					|поступления от покупателей, оплата поставщикам за товар, услуги, связь, аренду, заработная плата, налоги. 
					|Поступлений по основной деятельности должно быть достаточно для закупки новых материалов, товаров и, при 
					|необходимости, компенсации отрицательных денежных потоков по инвестиционной и финансовой деятельности.  
					|Денежный поток по операционной деятельности - основной источник денежных средств компании.'");
		
	ИначеЕсли Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ФинансоваяДеятельность Тогда
		
		Описание =  НСтр("ru = 'Финансовая деятельность обеспечивает основную деятельность дополнительными финансовыми ресурсами. 
					|К финансовой деятельности относятся поступления и платежи по привлечению кредитов и займов, а также вложения собственников, выплата дивидендов. 
					|Финансовая деятельность является поставщиком денежных ресурсов для обеспечения основной и инвестиционной деятельности.'");
		
	ИначеЕсли Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ИнвестиционнаяДеятельность Тогда
		
		Описание =  НСтр("ru = 'Инвестиционная деятельность связана с развитием компании: приобретение помещений, техники, оборудования, развитие новых проектов, вложения в другие компании. 
					|Поступления по инвестиционной деятельности показывают продажу активов в связи с устареванием, ненужностью, сменой ассортимента. 
					|При развитии и росте компания направляет деньги на обновление и приобретение своих активов, что приводит к отрицательному потоку по инвестиционной деятельности. 
					|Такой отток денежных средств покрывается за счет основной и финансовой деятельности.'");
		
	ИначеЕсли Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещенияКурсовыеРазницы Тогда
		
		Описание =  НСтр("ru = 'Статьи, которые не должны влиять на суммы денежных потоков. 
					|Внутренние перемещения денежных средств между расчетными счетами и кассами вашей компании. 
					|И курсовая разница, возникающая при пересчете поступлений, выплат и остатков денежных средств по курсам на разные даты.'");
		
	Иначе
		
		Описание = "";
		
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

// Возвращает строковый ключ объекта для сохранения настроек формы списка и формы выбора
//
//
Функция ПолучитьКлючОбъекта() Экспорт
	
	Возврат "СправочникСтатьиДвиженияДенежныхСредств"; // Не локализуется
	
КонецФункции

// Обновляет наименование группы "Перемещения" при включении учета валютных операций
//
//
Процедура ОбновитьНаименованиеГруппыПеремещения() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций") 
		И Справочники.СтатьиДвиженияДенежныхСредств.ПеремещенияКурсовыеРазницы.Наименование = НСтр("ru = 'Перемещения'") Тогда
	
		Группа = Справочники.СтатьиДвиженияДенежныхСредств.ПеремещенияКурсовыеРазницы.ПолучитьОбъект();
	    Группа.Наименование = НСтр("ru = 'Перемещения и курсовые разницы'");
		Группа.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Недействителен") Тогда
		Параметры.Отбор.Вставить("Недействителен", Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
